{
  "TITLE": "Presentazione personale",
  "SUBTITLE": "Sono una persona multipotenziale che ha scoperto una grande passione per il coding e per lo sviluppo software. Focalizzato sulla parte FrontEnd con competenze basilari di sviluppo BackEnd, la mia attività quotidiana consiste in scrivere codice testabile, manutenibile e funzionante. L' amore per le interazioni umane e proattive è la mia chiave per una collaborazione efficace in team",
  "INTRO": {
    "TITLE": "Introduzione",
    "DESCRIPTION": "Ciao! Sono Simone Zambon, sono italiano e ho sempre vissuto vicino alla città di Varese. Ho 30 anni e da più di 5 anni lavoro come sviluppatore FrontEnd, ma possiedo anche conoscenze di sviluppo BackEnd e nozioni di UX/UI."
  },
  "EDUCATION": {
    "TITLE": "Formazione scolastica",
    "SCIENCE": "Ho sempre amato la matematica, le scienze in generale e smanettare con il PC, perciò scelsi di frequentare il Liceo Scientifico, presso il quale conseguii il diploma di maturità con l'intenzione di intraprendere un percorso di formazione universitaria in ambito IT.",
    "ARTS": "Amo però molto anche l'arte, soprattutto il disegno, e questo mi portò invece a lanciarmi in un percorso di formazione artistica presso l'Accademia di Belle Arti. Mi resi però conto che non mi sentivo del tutto adatto a questo mondo, quindi decisi di formarmi in una professione che mi piacesse e che allo stesso tempo mi garantisse una sufficiente indipendenza economica."
  },
  "PROFESSIONAL_EDUCATION": {
    "TITLE": "Formazione professionale",
    "DEVELOPER": "Ho partecipato ad un corso intensivo di programmazione in Java finalizzato all's assunzione, al quale potei accedere solo passando con successo un test attitudinale poichè non avevo competenze comprovate di IT. Terminato il corso a novembre 2019, venni valutato e poi assunto come Junior Developer dall'azienda Dale Consulting.",
    "BARTENDER": "Prima di iniziare a lavorare come sviluppatore, conseguii un attestato di qualifica professionale come Bartender e lavorai in pub, discoteche e come freelance ad eventi privati."
  },
  "ATTITUDE": {
    "TITLE": "Attitudine",
    "MULTIPOTENTIALITY": "Sono una persona che non ha una passione in particolare: amo tante attività e cose diverse, ognuna soddisfacente a suo modo. Questa consapevolezza mi ha portato a dedicare tempo ed energie per capire verso che direzione voglio migliorarmi in ogni fase della mia vita.",
    "CURIOSITY": "La mia curiosità mi porta a farmi molte domande e quindi a scoprire ed approfondire molti temi imparando in fretta, sia nel lavoro che nella vita privata.",
    "SOCIALITY": "Amo le interazioni umane: ho sincero piacere a interagire con gli altri, soprattutto ovviamente se con esito positivo. Adoro viaggiare perchè soddisfa e alimenta la mia curiosità e mi permette di conoscere nuove culture attraverso l'interazione. Ho avuto prova della potenza delle interazioni umane e mi impegno ad applicarla al lavoro in team.",
    "MORE_INFO": "Per maggiori informazioni sulle mie abilità personali, <a href=\"/skills/soft-skills\">vai alla sezione dedicata</a>"
  }
}