{
  "TITLE": "Esperienze professionali secondarie",
  "SUBTITLE": "Le mie prime professioni sono state Bartender/Bar manager e cameriere, che ho svolto in diverse occasioni anche durante la mia carriera come sviluppatore. Oltre a queste, ho svolto diverse altre professioni",
  "BARTENDER": {
    "TITLE": "Bartender - Bar manager - Cameriere",
    "DESCRIPTION": "Dopo aver conseguito un certificato di qualifica professionale come Bartender nel 2015 ho subito iniziato a lavorare in pub e piccoli eventi privati. A settembre dello stesso anno sono stato assunto come barman e cameriere nel pub \"Taverna del Bucaniere\" a Gallarate, Italia, dove ho acquisito sempre più esperienza ed autonomia fino a gestire autonomamente il pub, gli ordini dei prodotti serviti e gli eventi. Durante tutta la mia permanenza in questo pub ho continuato a lavorare come barman in locali, club e grandi eventi, sia in Italia che in Svizzera. Tutt'ora svolgo questa professione saltuariamente."
  },
  "RECEPTION": {
    "TITLE": "Reception - Guida turistica - Pulizie",
    "MAIN_TASK": "In Ottobre 2018 ho intrapreso un viaggio di 6 mesi in America Latina, dal Costa Rica a Cuba passando per Panama e Colombia. Per sostenere le mie spese ho lavorato per un mese come receptionist, nel servizio pulizie e come promoter presso l'ostello \"Bikini Hostel\" di Puerto Viejo de Talamanca, Costa Rica: svolgevo le attività di check-in/check-out degli ospiti e pulizia/preparazione degli alloggi, delle aree comuni e dei servizi. Ho svolto le stesse mansioni anche nell'ostello \"InboXChange Hostel\" di Medellin, Colombia.",
    "GUIDE": "Grazie anche alla mia socialità ho migliorato in fretta la mia lingua spagnola e inglese, mentre la mia curiosità mi ha portato a conoscere profondamente la città di Medellin e della sua storia, così mi è stato affidato anche il compito di fare da guida turistica amatoriale ai nuovi ospiti dell'ostello."
  },
  "CNC": {
    "TITLE": "Programmatore e operatore di macchine CNC",
    "DESCRIPTION": "In autunno del 2016 ho lavorato come programmatore e operatore di torni e frese a controllo numerico per una piccola impresa di metalmeccanica di precisione a Caronno Varesino, Varese. Non è stato facile apprendere le nozioni necessarie: vista la pericolosità, la delicatezza e il valore economico degli strumenti utilizzati la mole di informazioni e e comportamenti necessari per programmare e operare correttamente con la macchina era molto grande. Ho imparato molto anche se l'attività è stata di appena 3 mesi."
  },
  "VOLUNTEER": {
    "TITLE": "Volontario in un centro per persone affette da Alzheimer",
    "INTRO": "Ispirato da amici e compagni di classe e incoraggiato dalla scuola ho scelto di cimentarmi in un programma di volontariato presso un centro diurno per malati di Alzheimer. Il centro ospitava quasi tutte persone anziane per attività ludiche pomeridiane.",
    "MAIN_TASK": "Affiancato ad una operatrice di Pet Therapy e ad altri volontari, intrattenevamo gli ospiti con giochi e conversazioni sia per rendere i loro pomeriggi più piacevoli, sia per rallentare la degenerazione della malattia. Non sono mancate risate e momenti toccanti con gli ospiti: la mia empatia mi portava a coinvolgermi molto emotivamente ma il piacere di intrattenermi con loro mi ha permesso di relazionarmici anche con semplicità e condividere molti sorrisi."
  }
}
